In [37]:
#=================================> DATA TYPES <=======================================

#                                 String Datatypes
# CHAR(size)	    :Maximum size of 255 characters.	Where size is the number of characters to store. Fixed-length strings. Space padded on right to equal size characters.
# VARCHAR(size)	    :Maximum size of 255 characters.	Where size is the number of characters to store. Variable-length string.
# TINYTEXT(size)	:Maximum size of 255 characters.	Where size is the number of characters to store.
# TEXT(size)	    :Maximum size of 65,535 characters.	Where size is the number of characters to store.
# MEDIUMTEXT(size)  :Maximum size of 16,777,215 characters.	Where size is the number of characters to store.
# LONGTEXT(size)	:Maximum size of 4GB or 4,294,967,295 characters.	Where size is the number of characters to store.
# BINARY(size)	    :Maximum size of 255 characters.	Where size is the number of binary characters to store. Fixed-length strings. Space padded on right to equal size characters.
# VARBINARY(size)	:Maximum size of 255 characters.	Where size is the number of characters to store. Variable-length string.


#                                 Numeric Datatypes
# BIT	                :Very small integer value that is equivalent to TINYINT(1).Signed values range from -128 to 127. Unsigned values range from 0 to 255.	 
# TINYINT(m)	        :Very small integer value. Signed values range from -128 to 127. Unsigned values range from 0 to 255.	 
# SMALLINT(m)	        :Small integer value. Signed values range from -32768 to 32767. Unsigned values range from 0 to 65535.	 
# MEDIUMINT(m)          :Medium integer value. Signed values range from -8388608 to 8388607. Unsigned values range from 0 to 16777215.	 
# INT(m)	            :Standard integer value. Signed values range from -2147483648 to 2147483647. Unsigned values range from 0 to 4294967295.	 
# INTEGER(m)	        :Standard integer value. Signed values range from -2147483648 to 2147483647. Unsigned values range from 0 to 4294967295.
# BIGINT(m)	            :Big integer value.Signed values range from -9223372036854775808 to 9223372036854775807. Unsigned values range from 0 to 18446744073709551615.	 
# DECIMAL(m,d)          :Unpacked fixed point number.m defaults to 10, if not specified.d defaults to 0, if not specified.Where m is the total digits and d is the number of digits after the decimal.
# DEC(m,d)	            :Unpacked fixed point number.m defaults to 10, if not specified.d defaults to 0, if not specified.	Where m is the total digits and d is the number of digits after the decimal.This is a synonym for the DECIMAL datatype.
# NUMERIC(m,d)          :Unpacked fixed-point number.m defaults to 10, if not specified.d defaults to 0, if not specified.	Where m is the total digits and d is the number of digits after the decimal.This is a synonym for the DECIMAL datatype.
# FIXED(m,d)	        :Unpacked fixed-point number.m defaults to 10, if not specified.d defaults to 0, if not specified.	Where m is the total digits and d is the number of digits after the decimal.This is a synonym for the DECIMAL datatype.
# FLOAT(m,d)	        :Single precision floating point number.	Where m is the total digits and d is the number of digits after the decimal.
# DOUBLE(m,d)	        :Double precision floating point number.	Where m is the total digits and d is the number of digits after the decimal.
# DOUBLE PRECISION(m,d) :Double precision floating point number.	Where m is the total digits and d is the number of digits after the decimal.This is a synonym for the DOUBLE datatype.
# REAL(m,d)	            :Double precision floating point number.	Where m is the total digits and d is the number of digits after the decimal.This is a synonym for the DOUBLE datatype.
# FLOAT(p)	            :Floating point number.	Where p is the precision.   
# BOOL	                :Synonym for TINYINT(1)	Treated as a boolean data type where a value of 0 is considered to be FALSE and any other value is considered to be TRUE.
# BOOLEAN	            :Synonym for TINYINT(1)	Treated as a boolean data type where a value of 0 is considered to be FALSE and any other value is considered to be TRUE.


#                                 Date/Time Datatypes
# DATE	        :A date value in CCYY-MM-DD format. Values range from '1000-01-01' to '9999-12-31'.
# TIME	        :A time value in hh:mm:ss format. 	Values range from '-838:59:59' to '838:59:59'.
# DATETIME	    :A date and time value inCCYY-MM-DD hh:mm:ssformat. 	Values range from '1000-01-01 00:00:00' to '9999-12-31 23:59:59'.
# TIMESTAMP	    :A timestamp value in CCYY-MM-DD hh:mm:ss format.   Values range from '1970-01-01 00:00:01' UTC to '2038-01-19 03:14:07' UTC.
# YEAR	        :A year value in CCYY or YY format. Year value as 2 digits or 4 digits.


#                                 Large Object (LOB) Datatypes
# TINYBLOB	    :Maximum size of 255 bytes.	 
# BLOB(size)	:Maximum size of 65,535 bytes.	Where size is the number of characters to store (size is optional and was introduced in MySQL 4.1)
# MEDIUMBLOB	:Maximum size of 16,777,215 bytes.	 
# LONGTEXT	    :Maximum size of 4GB or 4,294,967,295 characters.


#                                  SQL Commands types
# DDL : Data Definition Language    : create,alter,rename,truncate,drop 
# DQL : Data Query Language         : select
# DML : Data Manipulation Language  : insert, update, delete
# DCL : Data Control Language       : grant, revoke permission to users                     (who can see what data)
# TCL : Transaction Control Language: start transaction, commit, rollback

# PRIMARY KEY : 
                * Is a column or set of column in table that uniquely identify each row(a unique id). 
                * There is only 1 PK in a table and it should not be NULL
                * The primary key column cannot be null or empty.
                * MySQL does not allow us to insert a new row with the existing primary key.
                * It is recommended to use INT or BIGINT data type for the primary key column.

# FOREIGN KEY : 
                * Is a column or set of column in a table that refers to PK of other table
                * There can be multiple Fk
                * Can have duplicate & null values.


# Composite Key :
                * It is a combination of two or more than two columns in a table that allows us to identify each row of the table uniquely.

                * Any key such as primary key, super key, or candidate key can be called composite key when they have combined with more than one attribute.



# Constraints :
                * Constraints are used to specify rules for data in table.
                * Constraints -> (NOT NULL, CHECK, DEFAULT, PRIMARY_KEY, AUTO_INCREMENT, UNIQUE, INDEX, ENUM, FOREIGN_KEY)

# CLAUSES :     
                * SELECT, WHERE, ORDER BY, LIMIT, GROUP BY , HAVING, DISTINCT
                
# GENERAL ORDER OF CLAUSES FOR STATEMENTS :
            * SELECT column(s)
            * FROM table_name
            * WHERE condition
            * GROUP BY column(s)
            * HAVING condition
            * ORDER BY column(s) ASC/DESC

# OPERATORS :                                  
                * 1.Arithematic  : +,-,*,/,%(remainder),*,/(quitient)
                * 2.Comparison   : =,!=,>,<,>=,<=
                * 3.Logical      : AND,OR,NOT,IN,BETWEEN,ALL,LIKE,ANY
                * 4.Bitwise      : & (bitwise AND), | (bitwise OR)

# AGGREGATE FUNCTIONS : 
            For performing calculation on set of values & return a single value.
            * COUNT() * MAX()  * MIN()  * SUM()  * AVG()

In [2]:
import mysql.connector
from mysql.connector import Error

mydb = mysql.connector.connect(
    host='localhost',user='root',password='',database='mycollege'
)

if not mydb:
    print("Connection unsuccessful. /n Error:",Error)
else:
    print("Connection Successfull")

Connection Successfull

In [3]:
#---------> create cursor object

mycursor = mydb.cursor()

qry = '''USE mycollege'''
mycursor.execute(qry)

In [4]:
-- Active: 1692089398790@@127.0.0.1@3306@mycollege

#---------> create table   
CREATE TABLE student(
    id INT PRIMARY KEY, 
    name VARCHAR(30), 
    age INT NOT NULL
    );

SHOW DATABASES;                                             -- see databases

USE mycollege;                                              -- using a database

SHOW TABLES;

-- DESC student                                             -- describe a table
-- DROP TABLE student                                       -- delete a table   

INSERT INTO student VALUES(1,"AMAN",20);                    -- insert in table
INSERT INTO student VALUES(2,"SUDEEP",18);

-- TRUNCATE will empty the table
--  TRUNCATE TABLE student;

DESC student;

SELECT * FROM student;                                      -- see all data in table

INSERT INTO student VALUES(3,"Vineet",21),(4,"Ajay",20);    -- insert multiple values in table

SyntaxError: illegal target for annotation (178592026.py, line 1)

# Constraints :
            * Constraints are used to specify rules for data in table.
            * Constraints -> 
                    NOT NULL - Ensures that a column cannot have a NULL value
                    UNIQUE - Ensures that all values in a column are different
                    PRIMARY KEY - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table
                    FOREIGN KEY - Prevents actions that would destroy links between tables
                    CHECK - Ensures that the values in a column satisfies a specific condition
                    DEFAULT - Sets a default value for a column if no value is specified
                    CREATE INDEX - Used to create and retrieve data from the database very quickly
 
                    AUTO_INCREMENT - Auto-increment allows a unique number to be generated automatically when a new record is inserted into a table. Often this is the primary key field that we would like to be created automatically every time a new record is inserted., 
                    INDEX - The CREATE INDEX statement is used to create indexes in tables. Indexes are used to retrieve data from the database more quickly than otherwise. The users cannot see the indexes, they are just used to speed up searches/queries.,

In [ ]:
-- UNIQUE CONSTRAINT
CREATE TABLE temp1(
    id INT UNIQUE,
    name VARCHAR(20) NOT NULL,
    location VARCHAR(20)
)

INSERT INTO temp1(id,name,location) VALUES (101,'Deepak Gautam','Pune'),(102,'Ishita Kirti Gautam','Nainital');

drop table temp1;

SELECT * FROM temp1;

--INSERT INTO temp1 VALUES (101);                   -- Gives error as id 101 is already present in table


-- ==============================> PRIMARY KEY
CREATE TABLE temp2(
    id INT, 
    name VARCHAR(20), 
    age INT, 
    city VARCHAR(20),
    PRIMARY KEY(id)                                 -- or  PRIMARY KEY(id,name)
)

INSERT INTO temp2 VALUES (1,'John',35,'New York');
SELECT * FROM temp2;

-- ==============================> FORIGN KEY
CREATE TABLE temp3(
    emp_id int,
    emp_salary INT DEFAULT 25000,
    FOREIGN KEY(emp_id) REFERENCES temp2(id)       -- FOREIGN KEY
)

SELECT * FROM temp3;

INSERT INTO temp3(emp_id,emp_salary) VALUES (1,10000000);

In [ ]:
-- ==============================> FOREIGN KEY 

-- Creating the "departments" table
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50) NOT NULL
);

-- Inserting some sample data into the "departments" table
INSERT INTO departments (department_id, department_name)
VALUES
    (1, 'HR'),
    (2, 'IT'),
    (3, 'Finance');

-- Creating the "employees" table with a foreign key reference to "departments"
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(50) NOT NULL,
    department_id INT,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

-- Inserting some sample data into the "employees" table
INSERT INTO employees (employee_id, employee_name, department_id)
VALUES
    (101, 'John Doe', 1),
    (102, 'Jane Smith', 2),
    (103, 'Bob Johnson', 1),
    (104, 'Alice Brown', 3);

SELECT * FROM employees;

In [ ]:
-- ==============================> CHECK CONSTRAINT

-- CHECK limit values allowed in a column
CREATE TABLE city(
    id INT PRIMARY KEY,
    city VARCHAR(50),
    age INT,
    CONSTRAINT age_check CHECK (age > 18 AND city="Lucknow")
);

INSERT INTO city VALUES (1,'Delhi',23);             -- Error : constraint check failed
INSERT INTO city VALUES (2,'Mumbai',17);            -- Error : constraint check failed
INSERT INTO city VALUES (3,'Lucknow',20)

In [ ]:
-- ==============================> SELECT ,WHERE & DISTINCT CLAUSE 

USE mycollege;

CREATE TABLE kids(
    rollno INT PRIMARY KEY,
    name VARCHAR(30),
    marks INT NOT NULL,
    grade VARCHAR(1),
    city VARCHAR(20)
);


INSERT INTO kids VALUES
    (1,'John',85,'B','New York'),
    (2,'Jane',92,'A','London'),
    (3,'Tom',76,'C','Paris' ),
    (4,'Harry',95,'O','Toronto'),
    (5,'Mary',90,'B','Sydney'),
    (6,'Mark',88,'B','Beijing'),
    (7,'Lisa',79,'C','New York'),
    (8,'Emily',91,'A','Toronto'),
    (9,'Robert',89,'B','London'),
    (10,'Michael',98,'O','Berlin');

SELECT * FROM kids;

SELECT city FROM kids;

SELECT * FROM kids WHERE (marks>90);

SELECT * FROM kids WHERE (city = "Toronto")

SELECT DISTINCT grade FROM kids;

SELECT * FROM kids WHERE grade="O" AND marks>90

SELECT * FROM kids WHERE grade="O" AND marks>90 AND city="Berlin"

-- DROP TABLE kids;


# OPERATORS :      

      * 1.Arithematic  : +,-,*,/,%
      * 2.Comparison   : =,!=,>,<,>=,<=
      * 3.Logical      : AND,OR,NOT,IN,BETWEEN,ALL,LIKE,ANY
      * 4.Bitwise      : & (bitwise AND), | (bitwise OR)

In [ ]:
--==============================> UPDATE 
SELECT * FROM kids;
UPDATE kids SET grade="O" WHERE marks > 90;

-- UPDATE kids SET marks=90 and grade='A' WHERE rollno=3;

UPDATE kids SET marks=88 WHERE rollno=5;

UPDATE kids SET grade="O+" WHERE marks BETWEEN 97 AND 100;

UPDATE kids SET marks = marks+1;

In [ ]:
--==============================> DELETE

DELETE FROM kids WHERE marks<85;

In [ ]:
--==============================> FOREIGN KEY  (PK of parent table becomes FK of child table)

-- Parent table
create table dept(                      
    id INT PRIMARY KEY,
    name VARCHAR(30)
)

-- Child table
CREATE Table teacher(
    id INT PRIMARY KEY,
    name VARCHAR(30),
    dept_id INT,
    FOREIGN KEY (dept_id) REFERENCES dept(id)
    ON UPDATE CASCADE                           -- changes in parent will be rflctd here also
    ON DELETE CASCADE
)

SELECT * FROM dept;
SELECT * FROM teacher;


-- #  ON DELETE Cascade - when fk using this option, it del. th referencing rows in child tbl whn referencing table row is deleted in parent table which has a PK.

-- #  ON UPDATE Cascade - whn v crt a fk using this optn, the rfrncng rows r updated in child tbl whn the rfrncng row is updtd in parent tbl whn has a PK.

INSERT INTO dept VALUES (101,"English"),(102,"Mathematics");

INSERT INTO teacher VALUES (1,"Adam",101),(2,"Elicia Markus",102);

SELECT * FROM teacher;
SELECT * FROM dept;
UPDATE dept SET id=103 WHERE id=102;
SELECT * FROM dept;

In [ ]:
--==============================> ALTER    - used when we have to change the table schema
CREATE TABLE students (
    rollno INT PRIMARY KEY,
    name VARCHAR(30),
    marks INT NOT NULL,
    grade VARCHAR(1),
    city VARCHAR(30)
);

INSERT INTO students (rollno,name,marks,grade,city) VALUES
    (101,"Anil",78,"C","Pune"),
    (102,"Bhumika",93,"A","Mumbai"),
    (103,"Chetan",85,"B","Mumbai"),
    (104,"Dhruva",96,"A","Delhi"),
    (105,"Emanual",12,"F","Delhi"),
    (106,"Farah",82,"B","Delhi");

SELECT * FROM students

-- ALTER to add a column

ALTER TABLE students ADD COLUMN age INT

-- ALTER to DELETE a column
ALTER TABLE students DROP COLUMN age;

In [ ]:
-- ALTER to RENAME a table
ALTER TABLE students RENAME TO CSstudents;

SELECT * FROM CSstudents;

-- ALTER to CHANGE a COLUMN
ALTER TABLE CSstudents CHANGE COLUMN city location VARCHAR(30);

-- ALTER to MODIFY A COLUMN
ALTER TABLE CSstudents MODIFY COLUMN rollno INT NOT NULL;


-- TRUNCATE         //deletes all data in table 
TRUNCATE CSstudents;

-- DROP ADD         //deletes table
--DROP TABLE CSstudents;

-- change COLUMN name

ALTER TABLE CSstudents CHANGE name fullname VARCHAR(30);

In [ ]:
-- delete  all students whose marks<80
DELETE FROM CSstudents WHERE marks<80;

-- delete grades column
ALTER TABLE CSstudeNts DROP COLUMN grade;

SELECT * FROM CSstudents;

# JOINS : (like venn diagram)
            used to combine rows from two or more tables, based on a related column between them.
            1) INNER JOIN: Returns records that have matching values in both tables.
            2) LEFT JOIN: Return all records from the left table and the common records from both tables.
            3) RIGHT JOIN: Return all records from the right table and the common records from both tables.
            4) FULL JOIN: Return all records from both tables.

In [ ]:
-- INNER JOIN - there should be column that is common in both tables.
            --  return common data between both tables

CREATE TABLE scholars(
    id INT PRIMARY KEY,
    name VARCHAR(30)
    );

CREATE TABLE courses(
    id INT PRIMARY KEY,
    course VARCHAR(30)
    );

INSERT INTO scholars(id,name) VALUES(101,"Adam"),(102,"Bob"),(103,"Casey")

INSERT INTO courses(id,course) VALUES(102,"English"),(105,"Math"),(103,"Science"),(107,"Computer science")

SELECT * FROM scholars;
SELECT * FROM courses;

-- JOINING USING INNER JOIN
SELECT * FROM scholars INNER JOIN courses ON scholars.id = courses.id;

-- ALIAS
SELECT * 
FROM scholars as s 
INNER JOIN courses as c
ON s.id = c.id;

In [ ]:
-- LEFT JOIN: Return all records from the left table and the common records from both tables.

SELECT * FROM scholars as s
LEFT JOIN courses as c
ON s.id = c.id;

In [ ]:
-- RIGHT JOIN: Return all records from the right table and the common records from both tables.

SELECT * FROM scholars
RIGHT JOIN courses ON
scholars.id=courses.id

In [ ]:
-- FULL JOIN / UNION: Return all records when there is a match in eigher left or right table.

SELECT * FROM scholars
LEFT JOIN courses
ON  scholars.id = courses.id
UNION
SELECT * FROM scholars
RIGHT JOIN courses
ON scholars.id = courses.id;

In [ ]:
-- LEFT EXCLUSIVE JOIN : All records from left table excluding common records 

SELECT * FROM scholars
LEFT JOIN courses
ON scholars.id=courses.id
WHERE courses.id IS NULL;

In [ ]:
-- RIGHT EXCLUSIVE JOIN : All records from right table excluding common records 

SELECT * FROM scholars
RIGHT JOIN courses
ON scholars.id=courses.id
WHERE scholars.id IS NULL;

In [ ]:
-- FULL EXCLUSIVE JOIN : All data from both tables except common data.

SELECT * FROM scholars
LEFT JOIN courses
ON scholars.id=courses.id
WHERE courses.id IS NULL
UNION
SELECT * FROM scholars
RIGHT JOIN courses
ON scholars.id=courses.id
WHERE scholars.id IS NULL;


DESC scholars;

In [ ]:
-- SELF JOIN : JOIN table with itself.

CREATE TABLE empl(
    id INT,
    name VARCHAR(20),
    manager_id INT
    );

-- TRUNCATE empl;

INSERT INTO empl(id,name,manager_id) VALUES
        (101,"Adam",103),(102,"Bob",104),
        (103,"Casey",NULL),(104,"Donald",103);

SELECT * FROM empl;

-- SELF JOIN
SELECT * FROM 
empl AS a JOIN empl AS b
ON a.id = b.manager_id;

SELECT a.name AS manager_name, b.name
FROM empl as a
JOIN empl as b 
ON a.manager_id=b.id;

In [ ]:
SELECT * FROM scholars;
SELECT * FROM courses;
-- UNION : used to combine the result-set of 2 or more SELECT statements.
        -- Gives unique records.

SELECT name FROM scholars 
UNION 
SELECT course FROM courses 

-- UNION ALL (INTERSECTION): used to combine the result-set of 2 or more SELECT statements.
        -- Gives duplicate records.

SELECT id FROM scholars 
INTERSECT 
SELECT id FROM courses

In [ ]:
-- SUB QUERIES : sub or inner or nested query is a query within another sql query.
            -- it involves 2 select statements


SELECT * FROM csstudents;

INSERT INTO csstudents(rollno,fullname,marks,location) 
VALUES 
(107,"Rishabh",91,"Pune"),
(108,"Rohit",87,"Pune"),
(109,"Bishop",80,"Bihar"),
(110,"Ram Khilavan",88,"Bihar");

SELECT AVG(marks) from csstudents;

-- Print students who have scored than AVG marks.
SELECT rollno,fullname,marks FROM csstudents WHERE marks > 87;


-- Write a SQL Query to get the details of all the CS Students having marks > average marks.
SELECT * FROM csstudents
WHERE marks > (SELECT AVG(marks) FROM csstudents);   -- this is a sub query. It is a dynamic query

SELECT * FROM csstudents WHERE rollno % 2 = 0 ;

SELECT rollno FROM csstudents
WHERE rollno IN (
    SELECT rollno FROM csstudents 
    WHERE rollno % 2 = 0 
    );

 
SELECT MAX(marks),fullname,location FROM (
    SELECT * FROM csstudents 
    WHERE location='delhi'
    ) AS temp;
    

SELECT MAX(marks),fullname 
FROM csstudents 
WHERE location="Pune";

In [ ]:
-- MYSQL Views

SELECT * FROM csstudents;

CREATE VIEW view1 AS
SELECT rollno, fullname FROM csstudents;

SELECT * FROM view1;        --virtual table

-- DROP VIEW view1;